Revit 2024 API
ParameterTypeId.SymbolIdParam Property
 "Type Id"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId SymbolIdParam { get; }
Visual Basic
Public Shared ReadOnly Property SymbolIdParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ SymbolIdParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace